atanisoft/ESP32CommandStation/main/ESP32TrainDatabase.cpp
const char TEMP_TRAIN_CDI_DATA[] = R"xmlpayload(<?xml version="1.0"?>
<cdi xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:noNamespaceSchemaLocation="http://openlcb.org/schema/cdi/1/1/cdi.xsd">
<identification>
<manufacturer>github.com/atanisoft (Mike Dunston)</manufacturer>
<model>Virtual train node</model>
<hardwareVersion>ESP32-v1</hardwareVersion>
<softwareVersion>1.5.0</softwareVersion>
</identification>
<segment space='253'>
<name>Non-stored train</name>
<description>This train is not part of the train database, thus no configuration settings can be changed on it.</description>
</segment>
<segment space='248' origin='2131755008'>
<name>Programming track operation</name>
<description>Use this component to read and write CVs on the programming track of the command station.</description>
<int size='4'>
<name>Operating mode</name>
<map>
<relation><property>0</property><value>Disabled</value></relation>
<relation><property>1</property><value>Direct mode</value></relation>
<relation><property>2</property><value>POM mode</value></relation>
<relation><property>10</property><value>Advanced mode</value></relation>
</map>
</int>
<int size='4'>
<name>CV number</name>
<description>Number of CV to read or write (1..1024).</description>
<min>0</min>
<max>1024</max>
<default>0</default>
</int>
<int size='4'>
<name>CV value</name>
<description>Set 'Operating mode' and 'CV number' first, then: hit 'Refresh' to read the entire CV, or enter a value and hit 'Write' to set the CV.</description>
<min>0</min>
<max>255</max>
<default>0</default>
</int>
<int size='4'>
<name>Bit change</name>
<description>Set 'Operating mode' and 'CV number' first, then: write 1064 to set the single bit whose value is 64, or 2064 to clear that bit. Write 100 to 107 to set bit index 0 to 7, or 200 to 207 to clear bit 0 to 7. Values outside of these two ranges do nothing.</description>
<min>100</min>
<max>2128</max>
<default>1000</default>
</int>
<string size='24'>
<name>Read bits decomposition</name>
<description>Hit Refresh on this line after reading a CV value to see which bits are set.</description>
</string>
<group>
<name>Advanced settings</name>
<int size='4'>
<name>Repeat count for verify packets</name>
<description>How many times a direct mode bit verify packet needs to be repeated for an acknowledgement to be generated.</description>
<min>0</min>
<max>255</max>
<default>3</default>
</int>
<int size='4'>
<name>Repeat count for reset packets after verify</name>
<description>How many reset packets to send after a verify.</description>
<min>0</min>
<max>255</max>
<default>6</default>
</int>
</group>
</segment>
</cdi>
)xmlpayload";
const size_t TEMP_TRAIN_CDI_DATA_SIZE = sizeof(TEMP_TRAIN_CDI_DATA);


Esp32TrainDatabase::Esp32TrainDatabase(openlcb::SimpleStackBase *stack)
{
  trainCdiFile_.reset(new openlcb::ReadOnlyMemoryBlock(TRAIN_CDI_DATA, TRAIN_CDI_DATA_SIZE));
  tempTrainCdiFile_.reset(new openlcb::ReadOnlyMemoryBlock(TEMP_TRAIN_CDI_DATA, TEMP_TRAIN_CDI_DATA_SIZE));
  persistFlow_.emplace(stack->service()
                     , SEC_TO_NSEC(CONFIG_ROSTER_PERSISTENCE_INTERVAL_SEC)
                     , std::bind(&Esp32TrainDatabase::persist, this));

  LOG(INFO, "[TrainDB] Initializing...");
  if (Singleton<FileSystemManager>::instance()->exists(TRAIN_DB_JSON_FILE))
  {
    auto roster =
      Singleton<FileSystemManager>::instance()->load(TRAIN_DB_JSON_FILE);
    json stored_trains = json::parse(roster, nullptr, false);
    if (stored_trains.is_discarded())
    {
      LOG_ERROR("[TrainDB] database is corrupt, no trains loaded!");
      Singleton<FileSystemManager>::instance()->remove(TRAIN_DB_JSON_FILE);
      return;
    }
    for (auto &entry : stored_trains)
    {
      auto data = entry.get<Esp32PersistentTrainData>();
      auto ent = std::find_if(knownTrains_.begin(), knownTrains_.end(),
      [data](const auto &train)
      {
        return train->get_legacy_address() == data.address;
      });
      if (ent == knownTrains_.end())
      {
        LOG(INFO, "[TrainDB] Registering %u - %s (idle: %s, limited: %s)"
          , data.address, data.name.c_str()
          , data.automatic_idle ? JSON_VALUE_ON : JSON_VALUE_OFF
          , data.show_on_limited_throttles ? JSON_VALUE_ON : JSON_VALUE_OFF);
        auto train = new Esp32TrainDbEntry(data);
        train->reset_dirty();
        if (train->is_auto_idle())
        {
          uint16_t address = train->get_legacy_address();
          stack->executor()->add(new CallbackExecutable([address]()
          {
            auto trainMgr = Singleton<AllTrainNodes>::instance();
            trainMgr->allocate_node(DccMode::DCC_128, address);
          }));
        }
        knownTrains_.emplace_back(train);
      }
      else
      {
        LOG_ERROR("[TrainDB] Duplicate roster entry detected for loco addr %u."
                , data.address);
      }
    }
  }

  LOG(INFO, "[TrainDB] Found %d persistent roster entries."
    , knownTrains_.size());
}

#define FIND_TRAIN(id)                                    \
  std::find_if(knownTrains_.begin(), knownTrains_.end(),  \
    [id](const auto &train)                               \
    {                                                     \
      return train->get_legacy_address() == id;           \
    })

#define FIND_TRAIN_HINT(id, id2)                          \
  std::find_if(knownTrains_.begin(), knownTrains_.end(),  \
    [id,id2](const auto &train)                           \
    {                                                     \
      return train->get_traction_node() == id ||          \
             train->get_legacy_address() == id2;          \
    })

std::shared_ptr<TrainDbEntry> Esp32TrainDatabase::create_if_not_found(unsigned address
                                                                    , string name
                                                                    , DccMode mode)
{
  const std::lock_guard<std::mutex> lock(knownTrainsLock_);
  LOG(VERBOSE, "[TrainDB] Searching for roster entry for address: %u", address);
  auto entry = FIND_TRAIN(address);
  if (entry != knownTrains_.end())
  {
    LOG(VERBOSE, "[TrainDB] Found existing entry:%s."
      , (*entry)->identifier().c_str());
    return *entry;
  }
  auto index = knownTrains_.size();
  knownTrains_.emplace_back(
    new Esp32TrainDbEntry(Esp32PersistentTrainData(address, name, mode)));
  LOG(VERBOSE, "[TrainDB] No entry was found, created new entry:%s."
    , knownTrains_[index]->identifier().c_str());
  return knownTrains_[index];
}

