atanisoft/ESP32CommandStation/main/ESP32TrainDatabase.cpp
int Esp32TrainDatabase::get_index(unsigned address)
{
  auto ent = FIND_TRAIN(address);
  if (ent != knownTrains_.end())
  {
    return std::distance(knownTrains_.begin(), ent);
  }

  return -1;
}

bool Esp32TrainDatabase::is_train_id_known(openlcb::NodeID train_id)
{
  LOG(VERBOSE, "[TrainDB] searching for train with id: %s"
    , uint64_to_string_hex(train_id).c_str());
  dcc::TrainAddressType type;
  uint32_t addr =  0;
  // verify that it is a valid train node id
  if (TractionDefs::legacy_address_from_train_node_id(train_id, &type, &addr))
  {
    // only search with the address and discard the drive type (for now)
    auto ent = FIND_TRAIN(addr);
    if (ent != knownTrains_.end())
    {
      LOG(VERBOSE, "[TrainDB] %s", (*ent)->identifier().c_str());
    }
    return ent != knownTrains_.end();
  }
  return false;
}

void Esp32TrainDatabase::delete_entry(unsigned address)
{
  const std::lock_guard<std::mutex> lock(knownTrainsLock_);
  auto entry = FIND_TRAIN(address);
  if (entry != knownTrains_.end())
  {
    LOG(VERBOSE, "[TrainDB] Removing persistent entry for address %u", address);
    knownTrains_.erase(entry);
    entryDeleted_ = true;
  }
}

std::shared_ptr<TrainDbEntry> Esp32TrainDatabase::get_entry(unsigned train_id)
{
  const std::lock_guard<std::mutex> lock(knownTrainsLock_);
  LOG(VERBOSE, "[TrainDB] get_entry(%u) : %zu", train_id, knownTrains_.size());
  if (train_id < knownTrains_.size())
  {
    return knownTrains_[train_id];
  }
  // check if the train_id is a locomotive address that we know of
  auto entry = FIND_TRAIN(train_id);
  if (entry != knownTrains_.end())
  {
    return *entry;
  }
  return nullptr;
}

std::shared_ptr<TrainDbEntry> Esp32TrainDatabase::find_entry(openlcb::NodeID node_id
                                                           , unsigned hint)
{
  const std::lock_guard<std::mutex> lock(knownTrainsLock_);
  LOG(VERBOSE, "[TrainDB] Searching for Train Node:%s, Hint:%u"
    , uint64_to_string(node_id).c_str(), hint);
  auto entry = FIND_TRAIN_HINT(node_id, hint);
  if (entry != knownTrains_.end())
  {
    LOG(VERBOSE, "[TrainDB] Found existing entry: %s."
      , (*entry)->identifier().c_str());
    return *entry;
  }
  LOG(VERBOSE, "[TrainDB] No entry found!");
  return nullptr;
}

// The caller of this method expects a zero based index into the vector. This
// may be changed in the future to use the loco address instead.
unsigned Esp32TrainDatabase::add_dynamic_entry(uint16_t address, DccMode mode)
{
  const std::lock_guard<std::mutex> lock(knownTrainsLock_);
  size_t index = 0;
  
  LOG(VERBOSE, "[TrainDB] Searching for loco %d", address);

  // prevent duplicate entries in the roster
  auto ent = FIND_TRAIN(address);
  if (ent != knownTrains_.end())
  {
    index = std::distance(knownTrains_.begin(), ent);
    LOG(VERBOSE, "[TrainDB] Found existing entry (%zu)", index);
  }
  else
  {
    // track the index for the new train entry
    index = knownTrains_.size();

#ifdef CONFIG_ROSTER_AUTO_CREATE_ENTRIES
    LOG(VERBOSE
      , "[TrainDB] Creating persistent roster entry for locomotive %u."
      , address);

    // create the new entry, it will default to being marked dirty so it will
    // automatically persist.
    knownTrains_.emplace_back(
      new Esp32TrainDbEntry(
        Esp32PersistentTrainData(address, std::to_string(address), mode)));
#else
    LOG(VERBOSE
      , "[TrainDB] Adding temporary roster entry for locomotive %u."
      , address);
    // create the new entry and do not mark it as dirty so it doesn't
    // automatically persist. If the locomotive is later edited via the web UI
    // it will be marked as dirty and persisted at that point.
    knownTrains_.emplace_back(
      new Esp32TrainDbEntry(
        Esp32PersistentTrainData(address, std::to_string(address), mode)
      , false));
#endif
  }
  return index;
}

std::set<uint16_t> Esp32TrainDatabase::get_default_train_addresses(uint16_t limit)
{
  std::set<uint16_t> results;
  const std::lock_guard<std::mutex> lock(knownTrainsLock_);
  for(auto entry : knownTrains_)
  {
    if (entry->get_data().show_on_limited_throttles)
    {
      if (limit)
      {
        results.insert(entry->get_legacy_address());
        limit--;
      }
      else
      {
        break;
      }
    }
  }
  return results;
}

void Esp32TrainDatabase::set_train_name(unsigned address, std::string name)
{
  const std::lock_guard<std::mutex> lock(knownTrainsLock_);
  LOG(VERBOSE, "[TrainDB] Searching for train with address %u", address);
  auto entry = FIND_TRAIN(address);
  if (entry != knownTrains_.end())
  {
    LOG(VERBOSE, "[TrainDB] Setting train(%u) name: %s", address, name.c_str());
    (*entry)->set_train_name(name);
  }
  else
  {
    LOG_ERROR("[TrainDB] train %u not found, unable to set the name!", address);
  }
}

void Esp32TrainDatabase::set_train_auto_idle(unsigned address, bool idle)
{
  const std::lock_guard<std::mutex> lock(knownTrainsLock_);
  LOG(VERBOSE, "[TrainDB] Searching for train with address %u", address);
  auto entry = FIND_TRAIN(address);
  if (entry != knownTrains_.end())
  {
    LOG(VERBOSE, "[TrainDB] Setting auto-idle: %s"
      , idle ? JSON_VALUE_ON : JSON_VALUE_OFF);
    (*entry)->set_auto_idle(idle);
  }
  else
  {
    LOG_ERROR("[TrainDB] train %u not found, unable to set idle state!"
            , address);
  }
}

void Esp32TrainDatabase::set_train_show_on_limited_throttle(unsigned address
                                                          , bool show)
{
  const std::lock_guard<std::mutex> lock(knownTrainsLock_);
  LOG(VERBOSE, "[TrainDB] Searching for train with address %u", address);
  auto entry = FIND_TRAIN(address);
  if (entry != knownTrains_.end())
  {
    LOG(VERBOSE, "[TrainDB] Setting visible on limited throttes: %s"
      , show ? JSON_VALUE_ON : JSON_VALUE_OFF);
    (*entry)->set_show_on_limited_throttles(show);
  }
  else
  {
    LOG_ERROR("[TrainDB] train %u not found, unable to set limited throttle!"
            , address);
  }
}

void Esp32TrainDatabase::set_train_function_label(unsigned address, uint8_t fn_id, Symbols label)
{
  const std::lock_guard<std::mutex> lock(knownTrainsLock_);
  LOG(VERBOSE, "[TrainDB] Searching for train with address %u", address);
  auto entry = FIND_TRAIN(address);
  if (entry != knownTrains_.end())
  {
    (*entry)->set_function_label(fn_id, label);
  }
  else
  {
    LOG_ERROR("[TrainDB] train %u not found, unable to set function label!"
            , address);
  }
}

void Esp32TrainDatabase::set_train_drive_mode(unsigned address, commandstation::DccMode mode)
{
  const std::lock_guard<std::mutex> lock(knownTrainsLock_);
  LOG(VERBOSE, "[TrainDB] Searching for train with address %u", address);
  auto entry = FIND_TRAIN(address);
  if (entry != knownTrains_.end())
  {
    (*entry)->set_legacy_drive_mode(mode);
  }
  else
  {
    LOG_ERROR("[TrainDB] train %u not found, unable to set drive mode!"
            , address);
  }
}

string Esp32TrainDatabase::get_all_entries_as_json()
{
  const std::lock_guard<std::mutex> lock(knownTrainsLock_);
  string res = "[";
  for (auto entry : knownTrains_)
  {
    if (res.length() > 1)
    {
      res += ",";
    }
    res += get_entry_as_json_locked(entry->get_legacy_address());
  }
  res += "]";
  return res;
}

string Esp32TrainDatabase::get_entry_as_json(unsigned address)
{
  const std::lock_guard<std::mutex> lock(knownTrainsLock_);
  return get_entry_as_json_locked(address);
}

string Esp32TrainDatabase::get_entry_as_json_locked(unsigned address)
{
  auto entry = FIND_TRAIN(address);
  if (entry != knownTrains_.end())
  {
    auto train = (*entry);
    json j =
    {
      { "name", train->get_train_name() },
      { "address", train->get_legacy_address() },
      { "idleOnStartup", train->is_auto_idle() },
      { "defaultOnThrottles", train->is_show_on_limited_throttles() },
      { "mode",
        {
          { "name", static_cast<DccMode>(train->get_legacy_drive_mode()) },
          { "type", train->get_legacy_drive_mode() }
        }
      }
    };
    for (size_t idx = 0; idx < DCC_MAX_FN; idx++)
    {
      j["functions"].push_back(
      {
        { "id", idx },
        { "name", static_cast<Symbols>(train->get_function_label(idx)) },
        { "type", train->get_function_label(idx) }
      });
    }
    return j.dump();
  }
  return "{}";
}

void Esp32TrainDatabase::persist()
{
  const std::lock_guard<std::mutex> lock(knownTrainsLock_);
  LOG(VERBOSE, "[TrainDB] Checking if roster needs to be persisted...");
  auto ent = std::find_if(knownTrains_.begin(), knownTrains_.end(),
    [](const auto &train)
    {
      return train->is_dirty() && train->is_persisted();
    });
  if (ent != knownTrains_.end() || entryDeleted_)
  {
    LOG(VERBOSE, "[TrainDB] At least one entry requires persistence.");
    json j;
    size_t count = 0;
    for (auto entry : knownTrains_)
    {
      if (entry->is_persisted())
      {
        j.push_back(entry->get_data());
        count++;
      }
      entry->reset_dirty();
    }
    Singleton<FileSystemManager>::instance()->store(TRAIN_DB_JSON_FILE
                                                  , j.dump());
    LOG(INFO, "[TrainDB] Persisted %zu entries.", count);
    entryDeleted_ = false;
  }
  else
  {
    LOG(VERBOSE, "[TrainDB] No entries require persistence");
  }
}

} // namespace esp32cs
